src/effj/principle.org
*** 函数式遍历
Java8引入函数式编程后，可以使用函数式遍历
#+BEGIN_SRC java
  suits.forEach((suit) -> {
                  ranks.forEach((rank) -> {
                                  decks.add(new Card(suit, rank));
                          });
          });

  decks.forEach((c) -> {
                  System.out.println(c);
          });
#+END_SRC

1. 过滤：filter返回一个删除了选定元素的集合拷贝
2. 转换：map返回转换完毕的集合拷贝，reduce进行集合聚合
3. 平行迭代：递归代替迭代

* 熟悉和使用类库
+ 通过使用标准类库，可以充分利用这些编写标准类库的专家的知识，以及在你之前的其他人的使用经验。
+ 在每个重要的发行版本中，都会有许多新的特性被加入到类库中，与这些新特性保持同步是值得的

* 如果需要精确地答案，请避免使用float和double
float和double用来做浮点二进制计算的，以牺牲精度来换取快速，只适合于科学和工程计算

** 货币计算
float和double尤其不适合货币计算
#+BEGIN_SRC java
  //0.610000001
  System.out.println(1.03 - .42);
  //0.0999999998
  System.out.println(1.00 - 9 * .10);

  double funds = 1.00;
  int itemsBought = 0;
  for (double price = .10; funds >= price; price += .10) {
          funds -= price;
          itemsBought++;
  }
  //3 items bought.
  //Change: $0.39999999
  System.out.println(itemsBought + " items bought.");
  System.out.println("Change: $" + funds);
#+END_SRC

使用BigDecimal代替
#+BEGIN_SRC java
  final BigDecimal TEN_CENTS = new BigDecimal(".10");
  int itemsBought = 0;
  BigDecimal funds = new BigDecimal("1.00");
  for (BigDecimal price = TEN_CENTS;
       funds.compareTo(price) >= 0;
       price = price.add(TEN_CENTS)) {
          itemsBought++;
          funds = funds.subtract(price);
  }
          
  //4 items bought.
  //Money left: $0.00
  System.out.println(itemsBought + " items bought.");
  System.out.println("Money left over: $" + funds);
#+END_SRC

尽管BigDecimal很精确，但是不方便，也很慢。所以有些时候可以用int或long来表示分替代BigDecimal
#+BEGIN_SRC java
  int itemsBought = 0;
  int funds = 100;
  for (int price = 10; funds >= price; price += 10) {
          itemsBought++;
          funds -= price;
  }
  //4 items bought. 
  //Money left over: 0 cents
  System.out.println(itemsBought + " items bought.");
  System.out.println("Money left over: " + funds + " cents");
#+END_SRC
如果整数不超过9位十进制数字，可以使用int。如果不超过18位，可以使用long。超过18位使用BigDecimal

* 基本类型优先于装箱基本类型


** 基本类型只有值，装箱基本类型还具有对象引用
装箱基本类型运用==操作符几乎总是错误的

first和second的引用不一样的，所以用==比较的结果总是false
   #+BEGIN_SRC java
     // Broken comparator - can you spot the flaw?
     Comparator<Integer> naturalOrder = new Comparator<>() {
                     public int compare(Integer first, Integer second) {
                             return first < second ? -1 : (first == second ? 0 : 1);
                     }
             };
   #+END_SRC

使用自动装箱修复错误
#+BEGIN_SRC java
  Comparator<Integer> naturalOrder = new Comparator<Integer>() {
                  public int compare(Integer first, Integer second) {
                          int f = first;
  // Auto-unboxing
                          int s = second; // Auto-unboxing
                          return f < s ? -1 : (f == s ? 0 : 1); // No unboxing
                  }
          };
#+END_SRC

** 基本类型只有功能完备的值，而每个装箱基本类型还有非功能值null
下面代码会抛出空指针异常
   #+BEGIN_SRC java
     public class Unbelievable {
             static Integer i;
             public static void main(String[] args) {
                     if (i == 42)
                             System.out.println("Unbelievable");
             }
     }
   #+END_SRC

** 基本类型通常比装箱基本类型更节省时间和空间
   多次的自动装箱会产生大量的临时对象，浪费大量的空间和时间
   #+BEGIN_SRC java
     // Hideously slow program! Can you spot the object creation?
     public static void main(String[] args) {
             Long sum = 0L;
             for (long i = 0; i < Integer.MAX_VALUE; i++) {
                     sum += i;
             }
             System.out.println(sum);
     }
   #+END_SRC

** 何时使用装箱基本类型
+ 作为集合中的元素的键和值，无法将基本类型放在集合内
+ 范型中必须使用装箱基本类型作为类型参数
+ 在进行反射的方法调用时，必须使用装箱基本类型

