html/effj/principle.html

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">函数式遍历</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Java8引入函数式编程后，可以使用函数式遍历
</p>
<div class="org-src-container">

<pre class="src src-java">suits.forEach((suit) -&gt; {
        ranks.forEach((rank) -&gt; {
                decks.add(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Card</span>(suit, rank));
            });
    });

decks.forEach((c) -&gt; {
        System.out.println(c);
    });
</pre>
</div>

<ol class="org-ol">
<li>过滤：filter返回一个删除了选定元素的集合拷贝
</li>
<li>转换：map返回转换完毕的集合拷贝，reduce进行集合聚合
</li>
<li>平行迭代：递归代替迭代
</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">熟悉和使用类库</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>通过使用标准类库，可以充分利用这些编写标准类库的专家的知识，以及在你之前的其他人的使用经验。
</li>
<li>在每个重要的发行版本中，都会有许多新的特性被加入到类库中，与这些新特性保持同步是值得的
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">如果需要精确地答案，请避免使用float和double</h2>
<div class="outline-text-2" id="text-4">
<p>
float和double用来做浮点二进制计算的，以牺牲精度来换取快速，只适合于科学和工程计算
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">货币计算</h3>
<div class="outline-text-3" id="text-4-1">
<p>
float和double尤其不适合货币计算
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">//</span><span style="color: #ff4500;">0.610000001</span>
System.out.println(1.03 - .42);
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">0.0999999998</span>
System.out.println(1.00 - 9 * .10);

<span style="color: #98fb98;">double</span> <span style="color: #eedd82;">funds</span> = 1.00;
<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">itemsBought</span> = 0;
<span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">double</span> <span style="color: #eedd82;">price</span> = .10; funds &gt;= price; price += .10) {
    funds -= price;
    itemsBought++;
}
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">3 items bought.</span>
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">Change: $0.39999999</span>
System.out.println(itemsBought + <span style="color: #ffa07a;">" items bought."</span>);
System.out.println(<span style="color: #ffa07a;">"Change: $"</span> + funds);
</pre>
</div>

<p>
使用BigDecimal代替
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">final</span> <span style="color: #98fb98;">BigDecimal</span> <span style="color: #eedd82;">TEN_CENTS</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">BigDecimal</span>(<span style="color: #ffa07a;">".10"</span>);
<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">itemsBought</span> = 0;
<span style="color: #98fb98;">BigDecimal</span> <span style="color: #eedd82;">funds</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">BigDecimal</span>(<span style="color: #ffa07a;">"1.00"</span>);
<span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">BigDecimal</span> <span style="color: #eedd82;">price</span> = TEN_CENTS;
     funds.compareTo(price) &gt;= 0;
     price = price.add(TEN_CENTS)) {
    itemsBought++;
    funds = funds.subtract(price);
}

<span style="color: #ff4500;">//</span><span style="color: #ff4500;">4 items bought.</span>
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">Money left: $0.00</span>
System.out.println(itemsBought + <span style="color: #ffa07a;">" items bought."</span>);
System.out.println(<span style="color: #ffa07a;">"Money left over: $"</span> + funds);
</pre>
</div>

<p>
尽管BigDecimal很精确，但是不方便，也很慢。所以有些时候可以用int或long来表示分替代BigDecimal
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #98fb98;">int</span> <span style="color: #eedd82;">itemsBought</span> = 0;
<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">funds</span> = 100;
<span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">price</span> = 10; funds &gt;= price; price += 10) {
    itemsBought++;
    funds -= price;
}
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">4 items bought. </span>
<span style="color: #ff4500;">//</span><span style="color: #ff4500;">Money left over: 0 cents</span>
System.out.println(itemsBought + <span style="color: #ffa07a;">" items bought."</span>);
System.out.println(<span style="color: #ffa07a;">"Money left over: "</span> + funds + <span style="color: #ffa07a;">" cents"</span>);
</pre>
</div>
<p>
如果整数不超过9位十进制数字，可以使用int。如果不超过18位，可以使用long。超过18位使用BigDecimal
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">基本类型优先于装箱基本类型</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">基本类型只有值，装箱基本类型还具有对象引用</h3>
<div class="outline-text-3" id="text-5-1">
<p>
装箱基本类型运用==操作符几乎总是错误的
</p>

<p>
first和second的引用不一样的，所以用==比较的结果总是false
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Broken comparator - can you spot the flaw?</span>
<span style="color: #98fb98;">Comparator</span>&lt;<span style="color: #98fb98;">Integer</span>&gt; <span style="color: #eedd82;">naturalOrder</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Comparator</span>&lt;&gt;() {
        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">compare</span>(<span style="color: #98fb98;">Integer</span> <span style="color: #eedd82;">first</span>, <span style="color: #98fb98;">Integer</span> <span style="color: #eedd82;">second</span>) {
            <span style="color: #00ffff;">return</span> first &lt; <span style="color: #98fb98;">second</span> ? -1 : (first == second ? 0 : 1);
        }
    };
</pre>
</div>

<p>
使用自动装箱修复错误
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #98fb98;">Comparator</span>&lt;<span style="color: #98fb98;">Integer</span>&gt; <span style="color: #eedd82;">naturalOrder</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Comparator</span>&lt;<span style="color: #98fb98;">Integer</span>&gt;() {
        <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">int</span> <span style="color: #87cefa;">compare</span>(<span style="color: #98fb98;">Integer</span> <span style="color: #eedd82;">first</span>, <span style="color: #98fb98;">Integer</span> <span style="color: #eedd82;">second</span>) {
            <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">f</span> = first;
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Auto-unboxing</span>
            <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">s</span> = second; <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Auto-unboxing</span>
            <span style="color: #00ffff;">return</span> f &lt; <span style="color: #98fb98;">s</span> ? -1 : (f == s ? 0 : 1); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">No unboxing</span>
        }
    };
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">基本类型只有功能完备的值，而每个装箱基本类型还有非功能值null</h3>
<div class="outline-text-3" id="text-5-2">
<p>
下面代码会抛出空指针异常
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Unbelievable</span> {
    <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Integer</span> <span style="color: #eedd82;">i</span>;
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
        <span style="color: #00ffff;">if</span> (i == 42)
            System.out.println(<span style="color: #ffa07a;">"Unbelievable"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">基本类型通常比装箱基本类型更节省时间和空间</h3>
<div class="outline-text-3" id="text-5-3">
<p>
多次的自动装箱会产生大量的临时对象，浪费大量的空间和时间
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Hideously slow program! Can you spot the object creation?</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">String</span>[] <span style="color: #eedd82;">args</span>) {
    <span style="color: #98fb98;">Long</span> <span style="color: #eedd82;">sum</span> = 0L;
    <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">long</span> <span style="color: #eedd82;">i</span> = 0; i &lt; <span style="color: #7fffd4;">Integer</span>.<span style="color: #98fb98;">MAX_VALUE</span>; i++) {
        sum += i;
    }
    System.out.println(sum);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">何时使用装箱基本类型</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>作为集合中的元素的键和值，无法将基本类型放在集合内
</li>
<li>范型中必须使用装箱基本类型作为类型参数
</li>
<li>在进行反射的方法调用时，必须使用装箱基本类型
</li>
</ul>
</div>
</div>
</div>
