src/effj/principle.org
* 如果其他类型更合适，则尽量避免使用字符串
字符串不适合代替其他的值类型
+ 字符串不适合代替枚举类型
+ 字符串不适合代替聚集类型，使用一个静态成员类来取代
  #+BEGIN_SRC java
    // Inappropriate use of string as aggregate type
    String compoundKey = className + "#" + i.next();
  #+END_SRC
+ 字符串不适合代替能力表
客户端有可能使用同一个字符串，来表示不同的值
  #+BEGIN_SRC java
    // Broken - inappropriate use of string as capability!
    public class ThreadLocal {
            private ThreadLocal() { } // Noninstantiable

            // Sets the current thread's value for the named variable.
            public static void set(String key, Object value);

            // Returns the current thread's value for the named variable.
            public static Object get(String key);
    }
  #+END_SRC
使用静态类来代替字符串
#+BEGIN_SRC java
  public class ThreadLocal {
          private ThreadLocal() { } // Noninstantiable
          public static class Key { // (Capability)
                  Key() { }
          }


          // Generates a unique, unforgeable key
          public static Key getKey() {
                  return new Key();
          }
          
          public static void set(Key key, Object value);
          public static Object get(Key key);
  }
#+END_SRC
再进一步可以用ThreadLocal的实例对象引用来代替静态类Key，换句话说每次客户端都产生一个新的ThreadLocal对象来作为Key
#+BEGIN_SRC java
  public final class ThreadLocal {
          public ThreadLocal() { }
          public void set(Object value);
          public Object get();
  }
#+END_SRC
最后用范型来完成类型安全
#+BEGIN_SRC java
  public final class ThreadLocal<T> {
          public ThreadLocal() { }
          public void set(T value);
          public T get();
  }
#+END_SRC
如果要用String来表示能力的时候，请考虑使用更安全更优雅的java.util.ThreadLocal

* 当心字符串连接的性能
+ 连接n个字符串而重复使用'+'，则需要 n^2 的时间复杂度
+ 为了获得更好的性能，请使用StringBuilder替代String
+ 如果考虑线程安全性，请使用StringBuffer代码StringBuilder
