html/effj/principle.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">如果其他类型更合适，则尽量避免使用字符串</h2>
<div class="outline-text-2" id="text-6">
<p>
字符串不适合代替其他的值类型
</p>
<ul class="org-ul">
<li>字符串不适合代替枚举类型
</li>
<li>字符串不适合代替聚集类型，使用一个静态成员类来取代
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Inappropriate use of string as aggregate type</span>
<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">compoundKey</span> = className + <span style="color: #ffa07a;">"#"</span> + i.next();
</pre>
</div>
</li>
<li>字符串不适合代替能力表
</li>
</ul>
<p>
客户端有可能使用同一个字符串，来表示不同的值
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Broken - inappropriate use of string as capability!</span>
<span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ThreadLocal</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #87cefa;">ThreadLocal</span>() { } <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Noninstantiable</span>

    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Sets the current thread's value for the named variable.</span>
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">set</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">value</span>);

    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Returns the current thread's value for the named variable.</span>
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Object</span> <span style="color: #87cefa;">get</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">key</span>);
}
</pre>
</div>
<p>
使用静态类来代替字符串
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ThreadLocal</span> {
    <span style="color: #00ffff;">private</span> <span style="color: #87cefa;">ThreadLocal</span>() { } <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Noninstantiable</span>
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Key</span> { <span style="color: #ff4500;">// </span><span style="color: #ff4500;">(Capability)</span>
        <span style="color: #87cefa;">Key</span>() { }
    }


    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Generates a unique, unforgeable key</span>
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Key</span> <span style="color: #87cefa;">getKey</span>() {
        <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Key</span>();
    }

    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">set</span>(<span style="color: #98fb98;">Key</span> <span style="color: #eedd82;">key</span>, <span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">value</span>);
    <span style="color: #00ffff;">public</span> <span style="color: #00ffff;">static</span> <span style="color: #98fb98;">Object</span> <span style="color: #87cefa;">get</span>(<span style="color: #98fb98;">Key</span> <span style="color: #eedd82;">key</span>);
}
</pre>
</div>
<p>
再进一步可以用ThreadLocal的实例对象引用来代替静态类Key，换句话说每次客户端都产生一个新的ThreadLocal对象来作为Key
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">final</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ThreadLocal</span> {
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">ThreadLocal</span>() { }
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">set</span>(<span style="color: #98fb98;">Object</span> <span style="color: #eedd82;">value</span>);
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">Object</span> <span style="color: #87cefa;">get</span>();
}
</pre>
</div>
<p>
最后用范型来完成类型安全
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">public</span> <span style="color: #00ffff;">final</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">ThreadLocal</span>&lt;<span style="color: #98fb98;">T</span>&gt; {
    <span style="color: #00ffff;">public</span> <span style="color: #87cefa;">ThreadLocal</span>() { }
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">set</span>(<span style="color: #98fb98;">T</span> <span style="color: #eedd82;">value</span>);
    <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">T</span> <span style="color: #87cefa;">get</span>();
}
</pre>
</div>
<p>
如果要用String来表示能力的时候，请考虑使用更安全更优雅的java.util.ThreadLocal
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">当心字符串连接的性能</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>连接n个字符串而重复使用'+'，则需要 n<sup>2</sup> 的时间复杂度
</li>
<li>为了获得更好的性能，请使用StringBuilder替代String
</li>
<li>如果考虑线程安全性，请使用StringBuffer代码StringBuilder
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: klose</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
